UIC-RoboMaster/UICRM-Embedded/boards/base/DM_MC02_general/DM_MC02_general.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_4
ADC1.IPParameters=Rank-1\#ChannelRegularConversion,master,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,OffsetSignedSaturation-1\#ChannelRegularConversion,NbrOfConversionFlag
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetSignedSaturation-1\#ChannelRegularConversion=DISABLE
ADC1.Rank-1\#ChannelRegularConversion=1
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ADC1.master=1
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x24000000
CORTEX_M7.CPU_DCache=Enabled
CORTEX_M7.CPU_ICache=Enabled
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
CORTEX_M7.IPParameters=default_mode_Activation,CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings,Size-Cortex_Memory_Protection_Unit_Region0_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region0_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region0_Settings
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7.MPU_Control=MPU_HFNMI_PRIVDEF
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_512KB
CORTEX_M7.TypeExtField-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_TEX_LEVEL1
CORTEX_M7.default_mode_Activation=0
DCMI.IPParameters=PCKPolarity,JPEGMode
DCMI.JPEGMode=DCMI_JPEG_ENABLE
DCMI.PCKPolarity=DCMI_PCKPOLARITY_RISING
Dma.DCMI.11.Direction=DMA_PERIPH_TO_MEMORY
Dma.DCMI.11.EventEnable=DISABLE
Dma.DCMI.11.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.DCMI.11.Instance=DMA2_Stream4
Dma.DCMI.11.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.DCMI.11.MemInc=DMA_MINC_ENABLE
Dma.DCMI.11.Mode=DMA_NORMAL
Dma.DCMI.11.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Dma.DCMI.11.PeriphInc=DMA_PINC_DISABLE
Dma.DCMI.11.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.DCMI.11.Priority=DMA_PRIORITY_LOW
Dma.DCMI.11.RequestNumber=1
Dma.DCMI.11.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.DCMI.11.SignalID=NONE
Dma.DCMI.11.SyncEnable=DISABLE
Dma.DCMI.11.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.DCMI.11.SyncRequestNumber=1
Dma.DCMI.11.SyncSignalID=NONE
Dma.Request0=USART1_RX
Dma.Request1=USART1_TX
Dma.Request10=SPI2_TX
Dma.Request11=DCMI
Dma.Request12=SPI1_TX
Dma.Request13=SPI1_RX
Dma.Request14=UART7_TX
Dma.Request2=USART2_RX
Dma.Request3=USART2_TX
Dma.Request4=USART3_RX
Dma.Request5=UART8_RX
Dma.Request6=UART9_RX
Dma.Request7=USART10_RX
Dma.Request8=UART7_RX
Dma.Request9=SPI2_RX
Dma.RequestsNb=15
Dma.SPI1_RX.13.Direction=DMA_PERIPH_TO_MEMORY
Dma.SPI1_RX.13.EventEnable=DISABLE
Dma.SPI1_RX.13.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI1_RX.13.Instance=DMA2_Stream6
Dma.SPI1_RX.13.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPI1_RX.13.MemInc=DMA_MINC_ENABLE
Dma.SPI1_RX.13.Mode=DMA_NORMAL
Dma.SPI1_RX.13.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPI1_RX.13.PeriphInc=DMA_PINC_DISABLE
Dma.SPI1_RX.13.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPI1_RX.13.Priority=DMA_PRIORITY_MEDIUM
Dma.SPI1_RX.13.RequestNumber=1
Dma.SPI1_RX.13.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.SPI1_RX.13.SignalID=NONE
Dma.SPI1_RX.13.SyncEnable=DISABLE
Dma.SPI1_RX.13.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SPI1_RX.13.SyncRequestNumber=1
Dma.SPI1_RX.13.SyncSignalID=NONE
Dma.SPI1_TX.12.Direction=DMA_MEMORY_TO_PERIPH
Dma.SPI1_TX.12.EventEnable=DISABLE
Dma.SPI1_TX.12.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI1_TX.12.Instance=DMA2_Stream5
Dma.SPI1_TX.12.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPI1_TX.12.MemInc=DMA_MINC_ENABLE
Dma.SPI1_TX.12.Mode=DMA_NORMAL
Dma.SPI1_TX.12.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPI1_TX.12.PeriphInc=DMA_PINC_DISABLE
Dma.SPI1_TX.12.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPI1_TX.12.Priority=DMA_PRIORITY_MEDIUM
Dma.SPI1_TX.12.RequestNumber=1
Dma.SPI1_TX.12.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.SPI1_TX.12.SignalID=NONE
Dma.SPI1_TX.12.SyncEnable=DISABLE
Dma.SPI1_TX.12.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SPI1_TX.12.SyncRequestNumber=1
Dma.SPI1_TX.12.SyncSignalID=NONE
Dma.SPI2_RX.9.Direction=DMA_PERIPH_TO_MEMORY
Dma.SPI2_RX.9.EventEnable=DISABLE
Dma.SPI2_RX.9.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI2_RX.9.Instance=DMA2_Stream2
Dma.SPI2_RX.9.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPI2_RX.9.MemInc=DMA_MINC_ENABLE
Dma.SPI2_RX.9.Mode=DMA_NORMAL
Dma.SPI2_RX.9.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPI2_RX.9.PeriphInc=DMA_PINC_DISABLE
Dma.SPI2_RX.9.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPI2_RX.9.Priority=DMA_PRIORITY_VERY_HIGH
Dma.SPI2_RX.9.RequestNumber=1
Dma.SPI2_RX.9.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.SPI2_RX.9.SignalID=NONE
Dma.SPI2_RX.9.SyncEnable=DISABLE
Dma.SPI2_RX.9.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SPI2_RX.9.SyncRequestNumber=1
Dma.SPI2_RX.9.SyncSignalID=NONE
Dma.SPI2_TX.10.Direction=DMA_MEMORY_TO_PERIPH
Dma.SPI2_TX.10.EventEnable=DISABLE
Dma.SPI2_TX.10.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI2_TX.10.Instance=DMA2_Stream3
Dma.SPI2_TX.10.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPI2_TX.10.MemInc=DMA_MINC_ENABLE
Dma.SPI2_TX.10.Mode=DMA_NORMAL
Dma.SPI2_TX.10.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPI2_TX.10.PeriphInc=DMA_PINC_DISABLE
Dma.SPI2_TX.10.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPI2_TX.10.Priority=DMA_PRIORITY_VERY_HIGH
Dma.SPI2_TX.10.RequestNumber=1
Dma.SPI2_TX.10.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.SPI2_TX.10.SignalID=NONE
Dma.SPI2_TX.10.SyncEnable=DISABLE
Dma.SPI2_TX.10.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SPI2_TX.10.SyncRequestNumber=1
Dma.SPI2_TX.10.SyncSignalID=NONE
Dma.UART7_RX.8.Direction=DMA_PERIPH_TO_MEMORY
Dma.UART7_RX.8.EventEnable=DISABLE
Dma.UART7_RX.8.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.UART7_RX.8.Instance=DMA2_Stream1
Dma.UART7_RX.8.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.UART7_RX.8.MemInc=DMA_MINC_ENABLE
Dma.UART7_RX.8.Mode=DMA_NORMAL
Dma.UART7_RX.8.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.UART7_RX.8.PeriphInc=DMA_PINC_DISABLE
Dma.UART7_RX.8.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.UART7_RX.8.Priority=DMA_PRIORITY_VERY_HIGH
Dma.UART7_RX.8.RequestNumber=1
Dma.UART7_RX.8.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.UART7_RX.8.SignalID=NONE
Dma.UART7_RX.8.SyncEnable=DISABLE
Dma.UART7_RX.8.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.UART7_RX.8.SyncRequestNumber=1
Dma.UART7_RX.8.SyncSignalID=NONE
Dma.UART7_TX.14.Direction=DMA_MEMORY_TO_PERIPH
Dma.UART7_TX.14.EventEnable=DISABLE
Dma.UART7_TX.14.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.UART7_TX.14.Instance=DMA1_Stream5
Dma.UART7_TX.14.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.UART7_TX.14.MemInc=DMA_MINC_ENABLE
Dma.UART7_TX.14.Mode=DMA_NORMAL
Dma.UART7_TX.14.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.UART7_TX.14.PeriphInc=DMA_PINC_DISABLE
Dma.UART7_TX.14.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.UART7_TX.14.Priority=DMA_PRIORITY_VERY_HIGH
Dma.UART7_TX.14.RequestNumber=1
Dma.UART7_TX.14.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.UART7_TX.14.SignalID=NONE
Dma.UART7_TX.14.SyncEnable=DISABLE
Dma.UART7_TX.14.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.UART7_TX.14.SyncRequestNumber=1
Dma.UART7_TX.14.SyncSignalID=NONE
Dma.UART8_RX.5.Direction=DMA_PERIPH_TO_MEMORY
Dma.UART8_RX.5.EventEnable=DISABLE
Dma.UART8_RX.5.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.UART8_RX.5.Instance=DMA1_Stream6
Dma.UART8_RX.5.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.UART8_RX.5.MemInc=DMA_MINC_ENABLE
Dma.UART8_RX.5.Mode=DMA_NORMAL
Dma.UART8_RX.5.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.UART8_RX.5.PeriphInc=DMA_PINC_DISABLE
Dma.UART8_RX.5.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.UART8_RX.5.Priority=DMA_PRIORITY_MEDIUM
Dma.UART8_RX.5.RequestNumber=1
Dma.UART8_RX.5.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.UART8_RX.5.SignalID=NONE
Dma.UART8_RX.5.SyncEnable=DISABLE
Dma.UART8_RX.5.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.UART8_RX.5.SyncRequestNumber=1
Dma.UART8_RX.5.SyncSignalID=NONE
Dma.UART9_RX.6.Direction=DMA_PERIPH_TO_MEMORY
Dma.UART9_RX.6.EventEnable=DISABLE
Dma.UART9_RX.6.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.UART9_RX.6.Instance=DMA1_Stream7
Dma.UART9_RX.6.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.UART9_RX.6.MemInc=DMA_MINC_ENABLE
Dma.UART9_RX.6.Mode=DMA_NORMAL
Dma.UART9_RX.6.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.UART9_RX.6.PeriphInc=DMA_PINC_DISABLE
Dma.UART9_RX.6.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.UART9_RX.6.Priority=DMA_PRIORITY_MEDIUM
Dma.UART9_RX.6.RequestNumber=1
Dma.UART9_RX.6.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.UART9_RX.6.SignalID=NONE
Dma.UART9_RX.6.SyncEnable=DISABLE
Dma.UART9_RX.6.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.UART9_RX.6.SyncRequestNumber=1
Dma.UART9_RX.6.SyncSignalID=NONE
Dma.USART10_RX.7.Direction=DMA_PERIPH_TO_MEMORY
Dma.USART10_RX.7.EventEnable=DISABLE
Dma.USART10_RX.7.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART10_RX.7.Instance=DMA2_Stream0
Dma.USART10_RX.7.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART10_RX.7.MemInc=DMA_MINC_ENABLE
Dma.USART10_RX.7.Mode=DMA_NORMAL
Dma.USART10_RX.7.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART10_RX.7.PeriphInc=DMA_PINC_DISABLE
Dma.USART10_RX.7.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART10_RX.7.Priority=DMA_PRIORITY_HIGH
Dma.USART10_RX.7.RequestNumber=1
Dma.USART10_RX.7.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART10_RX.7.SignalID=NONE
Dma.USART10_RX.7.SyncEnable=DISABLE
Dma.USART10_RX.7.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART10_RX.7.SyncRequestNumber=1
Dma.USART10_RX.7.SyncSignalID=NONE
Dma.USART1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
Dma.USART1_RX.0.EventEnable=DISABLE
Dma.USART1_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART1_RX.0.Instance=DMA1_Stream0
Dma.USART1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART1_RX.0.MemInc=DMA_MINC_ENABLE
Dma.USART1_RX.0.Mode=DMA_NORMAL
Dma.USART1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART1_RX.0.PeriphInc=DMA_PINC_DISABLE
Dma.USART1_RX.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART1_RX.0.Priority=DMA_PRIORITY_VERY_HIGH
Dma.USART1_RX.0.RequestNumber=1
Dma.USART1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART1_RX.0.SignalID=NONE
Dma.USART1_RX.0.SyncEnable=DISABLE
Dma.USART1_RX.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART1_RX.0.SyncRequestNumber=1
Dma.USART1_RX.0.SyncSignalID=NONE
Dma.USART1_TX.1.Direction=DMA_MEMORY_TO_PERIPH
Dma.USART1_TX.1.EventEnable=DISABLE
Dma.USART1_TX.1.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART1_TX.1.Instance=DMA1_Stream1
Dma.USART1_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART1_TX.1.MemInc=DMA_MINC_ENABLE
Dma.USART1_TX.1.Mode=DMA_NORMAL
Dma.USART1_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART1_TX.1.PeriphInc=DMA_PINC_DISABLE
Dma.USART1_TX.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART1_TX.1.Priority=DMA_PRIORITY_VERY_HIGH
Dma.USART1_TX.1.RequestNumber=1
Dma.USART1_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART1_TX.1.SignalID=NONE
Dma.USART1_TX.1.SyncEnable=DISABLE
Dma.USART1_TX.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART1_TX.1.SyncRequestNumber=1
Dma.USART1_TX.1.SyncSignalID=NONE
Dma.USART2_RX.2.Direction=DMA_PERIPH_TO_MEMORY
Dma.USART2_RX.2.EventEnable=DISABLE
Dma.USART2_RX.2.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART2_RX.2.Instance=DMA1_Stream2
Dma.USART2_RX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART2_RX.2.MemInc=DMA_MINC_ENABLE
Dma.USART2_RX.2.Mode=DMA_NORMAL
Dma.USART2_RX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART2_RX.2.PeriphInc=DMA_PINC_DISABLE
Dma.USART2_RX.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART2_RX.2.Priority=DMA_PRIORITY_VERY_HIGH
Dma.USART2_RX.2.RequestNumber=1
Dma.USART2_RX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART2_RX.2.SignalID=NONE
Dma.USART2_RX.2.SyncEnable=DISABLE
Dma.USART2_RX.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART2_RX.2.SyncRequestNumber=1
Dma.USART2_RX.2.SyncSignalID=NONE
Dma.USART2_TX.3.Direction=DMA_MEMORY_TO_PERIPH
Dma.USART2_TX.3.EventEnable=DISABLE
Dma.USART2_TX.3.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART2_TX.3.Instance=DMA1_Stream3
Dma.USART2_TX.3.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART2_TX.3.MemInc=DMA_MINC_ENABLE
Dma.USART2_TX.3.Mode=DMA_NORMAL
Dma.USART2_TX.3.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART2_TX.3.PeriphInc=DMA_PINC_DISABLE
Dma.USART2_TX.3.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART2_TX.3.Priority=DMA_PRIORITY_VERY_HIGH
Dma.USART2_TX.3.RequestNumber=1
Dma.USART2_TX.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART2_TX.3.SignalID=NONE
Dma.USART2_TX.3.SyncEnable=DISABLE
Dma.USART2_TX.3.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART2_TX.3.SyncRequestNumber=1
Dma.USART2_TX.3.SyncSignalID=NONE
Dma.USART3_RX.4.Direction=DMA_PERIPH_TO_MEMORY
Dma.USART3_RX.4.EventEnable=DISABLE
Dma.USART3_RX.4.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART3_RX.4.Instance=DMA1_Stream4
Dma.USART3_RX.4.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART3_RX.4.MemInc=DMA_MINC_ENABLE
Dma.USART3_RX.4.Mode=DMA_NORMAL
Dma.USART3_RX.4.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART3_RX.4.PeriphInc=DMA_PINC_DISABLE
Dma.USART3_RX.4.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART3_RX.4.Priority=DMA_PRIORITY_MEDIUM
Dma.USART3_RX.4.RequestNumber=1
Dma.USART3_RX.4.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART3_RX.4.SignalID=NONE
Dma.USART3_RX.4.SyncEnable=DISABLE
Dma.USART3_RX.4.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART3_RX.4.SyncRequestNumber=1
Dma.USART3_RX.4.SyncSignalID=NONE
FDCAN1.CalculateBaudRateNominal=1000000
FDCAN1.CalculateTimeBitNominal=1000
FDCAN1.CalculateTimeQuantumNominal=142.85714285714286
FDCAN1.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal,NominalPrescaler,NominalTimeSeg1
FDCAN1.NominalPrescaler=12
FDCAN1.NominalTimeSeg1=4
FDCAN2.CalculateBaudRateNominal=1000000
FDCAN2.CalculateTimeBitNominal=1000
FDCAN2.CalculateTimeQuantumNominal=142.85714285714286
FDCAN2.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal,NominalPrescaler,NominalTimeSeg1
FDCAN2.NominalPrescaler=12
FDCAN2.NominalTimeSeg1=4
FDCAN3.CalculateBaudRateNominal=1000000
FDCAN3.CalculateTimeBitNominal=1000
FDCAN3.CalculateTimeQuantumNominal=142.85714285714286
FDCAN3.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal,NominalPrescaler,NominalTimeSeg1
FDCAN3.NominalPrescaler=12
FDCAN3.NominalTimeSeg1=4
FREERTOS.INCLUDE_xTaskAbortDelay=0
FREERTOS.INCLUDE_xTaskGetHandle=0
FREERTOS.IPParameters=Tasks01,configTOTAL_HEAP_SIZE,configUSE_NEWLIB_REENTRANT,configENABLE_FPU,configCHECK_FOR_STACK_OVERFLOW,configGENERATE_RUN_TIME_STATS,INCLUDE_xTaskAbortDelay,INCLUDE_xTaskGetHandle
FREERTOS.Tasks01=defaultTask,24,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
FREERTOS.configCHECK_FOR_STACK_OVERFLOW=2
FREERTOS.configENABLE_FPU=1
FREERTOS.configGENERATE_RUN_TIME_STATS=1
FREERTOS.configTOTAL_HEAP_SIZE=262144
FREERTOS.configUSE_NEWLIB_REENTRANT=1
File.Version=6
GPIO.groupedBy=Group By Peripherals
I2C2.IPParameters=Timing
I2C2.Timing=0x20303E5D
KeepUserPlacement=false
Mcu.CPN=STM32H723VGT6
Mcu.Family=STM32H7
Mcu.IP0=ADC1
Mcu.IP1=CORTEX_M7
Mcu.IP10=NVIC
Mcu.IP11=OCTOSPI2
Mcu.IP12=RCC
Mcu.IP13=SPI1
Mcu.IP14=SPI2
Mcu.IP15=SPI3
